       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
            DISPLAY 'PROGRAM2 RAN SUCCESSFULLY'.
            DISPLAY 'HELLO6'.
            STOP RUN.