       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
            DISPLAY 'PROGRAM3 RAN SUCCESSFULLY'.
            DISPLAY 'CHANGE ON JAN 18TH 2019'.
            STOP RUN.